app/controllers/admin_controller.rb

  def list
    @mobilephone = Mobiledata.order("mobiledatas.brand ASC")
---
SELECT `mobiledatas`.* FROM `mobiledatas` ORDER BY mobiledatas.brand ASC

  def show
    @product = Mobiledata.find(params[:id])
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`id` = 1) LIMIT 1

  def edit
    @mobilephone = Mobiledata.find(params[:id])
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`id` = 1) LIMIT 1

  def update
    @mobilephone = Mobiledata.find(params[:id])
    if @mobilephone.update_attributes(params[:mobilephone])
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`id` = 1) LIMIT 1
UPDATE `mobiledatas` SET `c100` = 618.0, `dbluetooth` = 'Yes, v2.1 with A2DP', `dusb` = 'Yes, v2.0', `fl` = 480.0, `fp` = 0.0, `fv` = 210.0, `image_url` = 'api4bk.jpg', `iop` = 748.0, `iosv` = 848.0, `ithp` = 0.0, `itp` = 99.0, `itv` = 398.0, `nocontract` = 1999.0, `p1500` = 0.0, `p700` = 99.0, `updated_at` = '2010-12-22 05:10:01' WHERE (`mobiledatas`.`id` = 1)
UPDATE `mobilephones` SET `brand` = 'abc', `modelname` = 'adwr', `updated_at` = '2010-12-14 11:28:49' WHERE (`mobilephones`.`id` = 7)

  def create
    @mobilephone = Mobiledata.new(params[:mobilephone])

    if @mobilephone.save
---
INSERT INTO `mobiledatas` (`battery`, `brand`, `c100`, `camera`, `color`, `cprimary`, `created_at`, `csecondary`, `cvideo`, `dbluetooth`, `dusb`, `dwlan`, `fjava`, `fl`, `formfactor`, `fos`, `fp`, `fpr`, `fradio`, `fv`, `gnetwork`, `image_url`, `iop`, `iosv`, `ithp`, `itp`, `itv`, `mcardslot`, `minternal`, `modelname`, `nocontract`, `p1500`, `p700`, `posid`, `quantity`, `updated_at`) VALUES ('Li-Ion 1300 mAh', 'HTC', 198.0, 1, NULL, '5 MP, autofocus, LED flash', '2010-12-22 06:09:44', 'No', 'Yes', 'Yes v2.1 with A2DP', 'Yes, microUSB v2.0', 'Wi-Fi 802.11 b/g', 'Via third party application', 98.0, 'Slate', 'Android OS, v2.1 (Eclair)', 0.0, NULL, 'Stereo FM radio', 0.0, '3G', 'htc/htc-a3333.jpg', 198.0, 298.0, 0.0, 0.0, 98.0, 'microSD, Upto 32Gb', 'ROM: 512 MB RAM: 384 MB', 'HTC WildFire', 498.0, 0.0, 0.0, 'htc-a3333', 2, '2010-12-22 06:09:44')
INSERT INTO `mobilephones` (`brand`, `color`, `created_at`, `image_url`, `modelname`, `posid`, `quantity`, `updated_at`) VALUES ('1', NULL, '2010-12-14 11:19:58', NULL, '1', NULL, NULL, '2010-12-14 11:19:58')

  def delete
    @mobilephone = Mobiledata.find(params[:id])
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`id` = 10) LIMIT 1