app/controllers/store_controller.rb

  def index
    @productlists = Mobiledata.where(:quantity => 1..100)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`quantity` BETWEEN 1 AND 100)

  def show
    @product = Mobiledata.find(params[:id])
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`id` = 1) LIMIT 1

  def apple
    @productlists = Mobiledata.where(:brand => 'Apple', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'Apple') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def blackberry
    @productlists = Mobiledata.where(:brand => 'Blackberry', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'Blackberry') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def htc
    @productlists = Mobiledata.where(:brand => 'HTC', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'HTC') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def lg
    @productlists = Mobiledata.where(:brand => 'LG', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'LG') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def motorola
    @productlists = Mobiledata.where(:brand => 'Motoraola', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'Motoraola') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def nokia
    @productlists = Mobiledata.where(:brand => 'Nokia', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'Nokia') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def samsung
    @productlists = Mobiledata.where(:brand => 'Samsung', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'Samsung') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def sonyericsson
    @productlists = Mobiledata.where(:brand => 'Sony Ericssion', :quantity => 1..10)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`brand` = 'Sony Ericssion') AND (`mobiledatas`.`quantity` BETWEEN 1 AND 10)

  def free
    @productlists = Mobiledata.where(:quantity => 1..100, :iop => 0)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`quantity` BETWEEN 1 AND 100) AND (`mobiledatas`.`iop` = 0)

  def noncam
    @productlists = Mobiledata.where(:quantity => 1..100, :camera => 0)
---
SELECT `mobiledatas`.* FROM `mobiledatas` WHERE (`mobiledatas`.`quantity` BETWEEN 1 AND 100) AND (`mobiledatas`.`camera` = 0)